<template>
  <footer class="footer">
    <LogoSvg />
    <a class="footer-link" href="">
      Политика конфиденциальности
    </a>
    <a class="footer-link" href="">
      Договор публичной оферты
    </a>
    <a class="footer-link" href="">
      Контакты
    </a>
    <div class="footer-socials">
      <a class="footer-socials_item" href="">
        <svg width="20" height="17" viewBox="0 0 20 17" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M19.9355 1.6682L16.9272 15.8765C16.7188 16.8849 16.1105 17.1265 15.2605 16.6599L10.6772 13.2682L8.46049 15.4099C8.21049 15.6599 8.00215 15.8765 7.54382 15.8765C6.94382 15.8765 7.04382 15.6515 6.84382 15.0849L5.26049 9.92653L0.718819 8.50986C-0.264514 8.2182 -0.272847 7.5432 0.935486 7.05153L18.6522 0.218196C19.4605 -0.140138 20.2355 0.418196 19.9272 1.65986L19.9355 1.6682Z" fill="#808190" />
        </svg>
      </a>
      <a class="footer-socials_item" href="">
        <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M19.4337 5.31558C19.3838 4.18736 19.1932 3.57151 19.0349 3.16398C18.8493 2.66091 18.5537 2.20568 18.1696 1.83153C17.7965 1.44685 17.3415 1.1512 16.8384 0.966536C16.4301 0.80815 15.8189 0.617996 14.6869 0.568074C13.4682 0.513615 13.1016 0.5 10.0036 0.5C6.90557 0.5 6.54305 0.513615 5.32027 0.568074C4.19278 0.617996 3.57663 0.80815 3.16919 0.966536C2.66644 1.15208 2.21147 1.44761 1.83752 1.83153C1.44954 2.2034 1.15185 2.6592 0.96728 3.16398C0.808932 3.57242 0.618368 4.18328 0.568913 5.31558C0.514466 6.53411 0.500854 6.90398 0.500854 10C0.500854 13.096 0.513561 13.4604 0.568007 14.6858C0.617463 15.8135 0.808024 16.4298 0.966372 16.8378C1.15209 17.3406 1.4477 17.7955 1.83162 18.1694C2.20462 18.5543 2.65966 18.8502 3.16283 19.0348C3.57118 19.1932 4.18189 19.3838 5.31438 19.4333C6.53307 19.4877 6.9024 19.5014 9.99768 19.5014C13.093 19.5014 13.4582 19.4877 14.681 19.4333C15.8089 19.3838 16.4246 19.1932 16.8321 19.0348C17.3322 18.8416 17.7864 18.5459 18.1656 18.1667C18.5447 17.7874 18.8403 17.3331 19.0335 16.8328C19.1919 16.4244 19.3824 15.8135 19.4323 14.6812C19.4863 13.4582 19.4999 13.0956 19.4999 10.0014C19.4999 6.90716 19.4863 6.53865 19.4337 5.31558ZM9.99632 15.9483C8.8182 15.949 7.66636 15.6001 6.68648 14.9459C5.70661 14.2916 4.94272 13.3614 4.49144 12.2729C4.04016 11.1844 3.92175 9.98647 4.15121 8.83064C4.38066 7.6748 4.94766 6.613 5.7805 5.77952C6.61333 4.94604 7.67458 4.37834 8.83001 4.14822C9.98545 3.91809 11.1832 4.03588 12.2717 4.48669C13.3602 4.9375 14.2906 5.70107 14.9451 6.68083C15.5997 7.66059 15.9491 8.81252 15.9491 9.99092C15.9486 11.5708 15.321 13.0858 14.2041 14.2029C13.0873 15.32 11.5726 15.9479 9.99314 15.9483H9.99632ZM16.1878 5.18896C15.9125 5.18995 15.6432 5.10921 15.4138 4.95697C15.1845 4.80473 15.0055 4.58783 14.8994 4.33375C14.7934 4.07967 14.7652 3.79983 14.8183 3.52968C14.8714 3.25953 15.0034 3.01121 15.1977 2.81618C15.392 2.62115 15.6398 2.48817 15.9097 2.43409C16.1795 2.38002 16.4594 2.40727 16.7138 2.5124C16.9682 2.61753 17.1857 2.79581 17.3387 3.02467C17.4918 3.25352 17.5734 3.52265 17.5734 3.79797C17.5733 4.16654 17.427 4.51999 17.1666 4.78078C16.9063 5.04156 16.5531 5.18836 16.1846 5.18896H16.1878Z" fill="#808190" />
        </svg>
      </a>
    </div>
    <v-list>
      <v-list-item
        v-for="(item, i) in items_first"
        :key="i"
        :to="item.to"
        router
      >
        <v-list-item-title v-text="item.title" />
      </v-list-item>
    </v-list>
    <v-list>
      <v-list-item
        v-for="(item, i) in items_second"
        :key="i"
        :to="item.to"
        router
      >
        <v-list-item-title v-text="item.title" />
      </v-list-item>
    </v-list>
    <v-list>
      <v-list-item
        v-for="(item, i) in items_third"
        :key="i"
        :to="item.to"
        router
      >
        <v-list-item-title v-text="item.title" />
      </v-list-item>
    </v-list>
    <div class="footer-bottom">
      <p>©2021. Все права соблюдены</p>
    </div>
  </footer>
</template>

<script>
import LogoSvg from "~~/components/svg/LogoSvg";

export default {
  components: {
    LogoSvg
  },
  data () {
    return {
      items_first: [
        {
          title: "Главная",
          to: "/"
        },
        {
          title: "Инвестиии",
          to: "/invests"
        },
        {
          title: "Резервый фонд",
          to: "/inspire"
        }
      ],
      items_second: [
        {
          title: "CRM",
          to: "/inspire"
        },
        {
          title: "Биржа услуг",
          to: "/stock"
        },
        {
          title: "Моя команда",
          to: "/mycomand"
        },
        {
          title: "Лояльность",
          to: "/inspire"
        }
      ],
      items_third: [
        {
          title: "FAQ",
          to: "/inspire"
        },
        {
          title: "Новости",
          to: "/news"
        },
        {
          title: "Группы Telegram",
          to: "/telegrams"
        }
      ]
    };
  }
};
</script>

<style lang="scss" scoped>
.footer-link {
  color: #6a6b79;

  .theme--light & {
    color: #afB0bb;
  }
}

.theme--dark.v-list {
  background: #131418;
}

.v-list-item {
  display: inline-block;
  min-height: auto;
}

.v-list-item--link::before {
  background: none;
}

.v-list-item__title {
  font-size: 13px;
  line-height: 20px;
}

.logo {
  max-width: 140px;
}

.v-sheet.v-list {
  padding: 0;

  .v-list-item {
    padding: 0 8px;

    .theme--light & {
      color: #afB0bb;
    }
  }
}
</style>
