<template>
  <div class="article-main">
    <NuxtLink class="link d-block mb-12" to="/news">
      <svg width="5" height="9" viewBox="0 0 5 9" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M0.2 5.0248C0.05 4.8748 0 4.7248 0 4.5248C0 4.3248 0.05 4.1748 0.2 4.0248L3.9 0.374805C4.05 0.224805 4.2 0.174805 4.35 0.174805C4.75 0.174805 5 0.474805 5 0.824805C5 0.974805 4.95 1.1748 4.8 1.2748L1.55 4.5248L4.8 7.7248C4.95 7.8748 5 8.0248 5 8.1748C5 8.52481 4.7 8.8248 4.35 8.8248C4.15 8.8248 4 8.7748 3.9 8.6248L0.2 5.0248Z" fill="#2D7BF6" />
      </svg>
      Главная
    </NuxtLink>
    <div class="article-main_date mb-8">
      14 августа, 2021
    </div>
    <v-row>
      <v-col md="8">
        <h1 class="article-main_ttl">
          Аналитик Bloomberg прогонозирует биткоину рост до $100 000
        </h1>
      </v-col>
    </v-row>
    <div class="d-flex align-center mb-5">
      <div class="news-label c-purple">
        Криптовалюта
      </div>
      <div class="news-label c-orange">
        Биржа
      </div>
    </div>
    <v-row>
      <v-col md="10">
        <div class="article-invest_img">
          <img src="/article.png" alt="">
        </div>
      </v-col>
    </v-row>
    <div>
      <v-row>
        <v-col md="10">
          <p>Сегодня мы разберем американский авиарынок на примере 5 главных его представителей, которые торгуются на Санкт-Петербургской бирже.</p>
          <h2>Ведущие игроки</h2>
          <p>
            American Airlines (NASDAQ: AAL) — самая крупная авиакомпания в мире по множеству параметров, например по размеру флота и пассажиропотоку. Компания выполняет международные и региональные рейсы. До пандемии совершала каждый день 6700 рейсов по 350 направлениям в 50 странах.
          </p>
          <p>
            United Airlines (NASDAQ: UAL) — вторая по размеру флота авиакомпания США, на которую работает около 74 тысяч человек. Кроме собственного рынка авиаперевозчик летает на все континенты, за исключением Антарктиды.
          </p>
          <p>
            Delta Air Lines (NYSE: DAL) — международная авиакомпания, базирующаяся в США. В 2019 году перевезла более 200 млн человек и была признана самым крупным авиаперевозчиком в мире по совокупной выручке и прибыли до налогообложения.
          </p>
          <p>
            Southwest Airlines (NYSE: LUV) — крупная американская авиакомпания, которая летает только по Северной Америке. Обслуживает 107 направлений в 40 штатах США и еще доставляет пассажиров в 10 стран Карибского бассейна: Мексика, Куба, Ямайка, Багамы, Аруба, Коста-Рика, Доминиканская Республика, Белиз, Каймановы острова, острова Теркс и Кайкос (британская заморская территория в Вест-Индии).
          </p>
          <h2>Влияние пандемии</h2>
          <p>
            В 2020 году многие авиаперевозчики оказались на грани банкротства после ввода карантинных ограничений в весенне-летний период. От этого пассажиропоток упал более чем на 90%, согласно данным TSA — агентства в США, которое отслеживает, сколько людей в аэропорту входят в зоны безопасности.
          </p>
          <p>
            Правительство США выделило в 2020 году помощь в размере 50 млрд долларов, а в 2021 году — еще 14 млрд долларов. Это позволило избежать сокращений: деньги направили на оплату труда сотрудников.
          </p>
          <p>
            Обратной стороной данной поддержки стал ряд ограничений:
          </p>
          <ol>
            <li>
              Авиакомпаниям запретили до 31 марта 2022 года выплачивать дивиденды и проводить байбэк.Ввели ограничения до 1 октября 2022 года на выплату премий руководству.
            </li>
            <li>
              о 31 марта 2022 года компаниям запрещается увольнять своих сотрудников или уменьшать их оклад.
            </li>
            <li>
              Авиакомпании до 31 марта 2022 года должны поддерживать регулярные воздушные перевозки.
            </li>
          </ol>
          <p>
            Многие компании, пытаясь увеличить свою финансовую устойчивость, выполнили ряд негативных корпоративных действий: выпустили новые акции и размыли доли действующих акционеров или взяли еще больше долгов.
          </p>
          <p>
            Наиболее удовлетворительный результат показала Alaska Air Group: компании удалось пройти проблемный 2020 год без сильного ухудшения своих показателей, далее со средним результатом идут Southwest Airlines, Delta Air Lines и United Airlines, а замыкает пятерку явный аутсайдер — American Airlines.
          </p>
          <img src="/article.png" alt="">
          <img src="/article.png" alt="">
          <h2>Что в итоге</h2>
          <p>
            На текущий момент хорошие результаты показывают небольшие американские авиакомпании: Alaska Air Group и Southwest Airlines. Они могут одними из первых выйти на прибыль уже в 3 квартале 2021 года благодаря сверхнизким показателям CASM и высокой загрузке рейсов.
          </p>
          <p>
            Далее идут Delta Air Lines и United Airlines. Эти компании смогли пройти трудный 2020 год без сильных потерь, но их текущие темпы восстановления финансовых показателей отстают от лидеров.
          </p>
          <p>
            Явный аутсайдер American Airlines крайне болезненно пережил карантинные ограничения на фоне слабой финансовой устойчивости. Компания вышла из кризиса с самым большим чистым долгом из данной пятерки, и только у нее собственный капитал меньше нуля.
          </p>
          <img src="/article.png" alt="">
        </v-col>
      </v-row>
    </div>
  </div>
</template>

<script>
import HttpService from "~/services/HttpService";

export default {
  components: {

  },
  data () {
    return {
      article: null
    };
  },
  async fetch () {
    const slug = this.$route.params.slug || null;
    if (slug) {
      const apiPath = "/news/" + slug;
      const response = await HttpService.get(apiPath);
      if (response.status === 200) {
        this.article = response.data;
      } else {
      // TODO
      }
    }
  },
  fetchOnServer: false
};
</script>

<style lang="scss" scoped>
  .news {
    &-label {
      background: #1b1d23;
      border-radius: 4px;
      padding: 4px 6px;
      display: flex;
      justify-content: center;
      align-items: center;
      font-size: 13px;
      line-height: 17px;
      margin-right: 5px;

      &.c-green {
        color: #61ccbf;
      }

      &.c-purple {
        color: #8d68f5;
      }

      &.c-orange {
        color: #f7aa50;
      }
    }
  }

  .article-main {
    p {
      font-size: 19px;
      line-height: 28px;
      color: #abacb8;
      margin-bottom: 20px;
      max-width: 720px;
    }

    h2 {
      font-weight: 600;
      font-size: 26px;
      line-height: 34px;
      color: #eef1f8;
      margin: 48px 0 20px;
      max-width: 720px;
    }

    img {
      border-radius: 16px;
      margin-bottom: 70px;
      max-width: 100%;
    }

    ol,
    ul {
      max-width: 720px;
      margin-bottom: 20px;

      li {
        font-size: 19px;
        line-height: 28px;
        color: #abacb8;
      }
    }

    img + h2 {
      margin-top: 0;
    }

    .article-invest_img {
      img {
        margin-bottom: 20px;
      }
    }
  }
</style>
