<template>
  <div>
    <div class="article-main">
      <NuxtLink class="link d-block mb-10" to="/learnlist">
        <svg width="5" height="9" viewBox="0 0 5 9" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M0.2 5.0248C0.05 4.8748 0 4.7248 0 4.5248C0 4.3248 0.05 4.1748 0.2 4.0248L3.9 0.374805C4.05 0.224805 4.2 0.174805 4.35 0.174805C4.75 0.174805 5 0.474805 5 0.824805C5 0.974805 4.95 1.1748 4.8 1.2748L1.55 4.5248L4.8 7.7248C4.95 7.8748 5 8.0248 5 8.1748C5 8.52481 4.7 8.8248 4.35 8.8248C4.15 8.8248 4 8.7748 3.9 8.6248L0.2 5.0248Z" fill="#2D7BF6" />
        </svg>
        Обучение
      </NuxtLink>
      <v-row>
        <v-col md="8">
          <h1 class="article-main_ttl">
            Lorem ipsum dolor sit amet
          </h1>
        </v-col>
      </v-row>
      <v-row>
        <v-col md="10">
          <div class="article-invest_img">
            <img src="/article.png" alt="">
          </div>
        </v-col>
      </v-row>
      <div>
        <v-row>
          <v-col md="10">
            <p>
              В 2020 году многие авиаперевозчики оказались на грани банкротства после ввода карантинных ограничений в весенне-летний период. От этого пассажиропоток упал более чем на 90%, согласно данным TSA — агентства в США, которое отслеживает, сколько людей в аэропорту входят в зоны безопасности.
            </p>
            <p>
              В 2020 году многие авиаперевозчики оказались на грани банкротства после ввода карантинных ограничений в весенне-летний период. От этого пассажиропоток упал более чем на 90%, согласно данным TSA — агентства в США, которое отслеживает, сколько людей в аэропорту входят в зоны безопасности.
            </p>
            <p>
              В 2020 году многие авиаперевозчики оказались на грани банкротства после ввода карантинных ограничений в весенне-летний период. От этого пассажиропоток упал более чем на 90%, согласно данным TSA — агентства в США, которое отслеживает, сколько людей в аэропорту входят в зоны безопасности.
            </p>
          </v-col>
        </v-row>
      </div>
    </div>
  </div>
</template>
